
## :white_check_mark: Apply Result

[CI link](https://github.com/mizzy/sakura-cloud-education-touch-demo/actions/runs/1512259608)

<pre><code>Apply complete! Resources: 20 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.ngw0 will be created
  + resource "aws_eip" "ngw0" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_eip.ngw1 will be created
  + resource "aws_eip" "ngw1" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.ngw0 will be created
  + resource "aws_nat_gateway" "ngw0" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_nat_gateway.ngw1 will be created
  + resource "aws_nat_gateway" "ngw1" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_route.private0 will be created
  + resource "aws_route" "private0" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private1 will be created
  + resource "aws_route" "private1" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private0 will be created
  + resource "aws_route_table" "private0" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private1 will be created
  + resource "aws_route_table" "private1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private0 will be created
  + resource "aws_route_table_association" "private0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private1 will be created
  + resource "aws_route_table_association" "private1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public0 will be created
  + resource "aws_route_table_association" "public0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public1 will be created
  + resource "aws_route_table_association" "public1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private0 will be created
  + resource "aws_subnet" "private0" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.private1 will be created
  + resource "aws_subnet" "private1" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public0 will be created
  + resource "aws_subnet" "public0" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public1 will be created
  + resource "aws_subnet" "public1" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.ecs_sample will be created
  + resource "aws_vpc" "ecs_sample" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "ecs-sample"
        }
      + tags_all                         = {
          + "Name" = "ecs-sample"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.
aws_vpc.ecs_sample: Creating...
aws_vpc.ecs_sample: Still creating... [10s elapsed]
aws_vpc.ecs_sample: Creation complete after 20s [id=vpc-05fa6437d1950b505]
aws_subnet.public0: Creating...
aws_route_table.public: Creating...
aws_subnet.private0: Creating...
aws_subnet.private1: Creating...
aws_route_table.private1: Creating...
aws_route_table.private0: Creating...
aws_internet_gateway.igw: Creating...
aws_subnet.public1: Creating...
aws_route_table.private0: Creation complete after 2s [id=rtb-04c52d0c2f4f6fb3e]
aws_route_table.private1: Creation complete after 3s [id=rtb-0eed5c91cda4b3acc]
aws_route_table.public: Creation complete after 3s [id=rtb-02b3748a419fb2683]
aws_subnet.private1: Creation complete after 3s [id=subnet-0b80416f81081f9d5]
aws_route_table_association.private1: Creating...
aws_subnet.private0: Creation complete after 3s [id=subnet-0360de0228650800c]
aws_route_table_association.private0: Creating...
aws_internet_gateway.igw: Creation complete after 3s [id=igw-0e1685b83df866267]
aws_route.public: Creating...
aws_eip.ngw1: Creating...
aws_eip.ngw0: Creating...
aws_eip.ngw0: Creation complete after 2s [id=eipalloc-04e367929021a68b1]
aws_eip.ngw1: Creation complete after 2s [id=eipalloc-0db2eac64498abb7a]
aws_route_table_association.private1: Creation complete after 2s [id=rtbassoc-03c410620e7b366e5]
aws_route_table_association.private0: Creation complete after 2s [id=rtbassoc-0104951db21990e4a]
aws_route.public: Creation complete after 3s [id=r-rtb-02b3748a419fb26831080289494]
aws_subnet.public0: Still creating... [10s elapsed]
aws_subnet.public1: Still creating... [10s elapsed]
aws_subnet.public0: Creation complete after 14s [id=subnet-02d54a30d5f61210a]
aws_route_table_association.public0: Creating...
aws_nat_gateway.ngw0: Creating...
aws_subnet.public1: Creation complete after 14s [id=subnet-0e4d908c8b6012cf4]
aws_route_table_association.public1: Creating...
aws_nat_gateway.ngw1: Creating...
aws_route_table_association.public1: Creation complete after 3s [id=rtbassoc-0b0139d2ccca64f23]
aws_route_table_association.public0: Creation complete after 3s [id=rtbassoc-00ef7c2460170cd58]
aws_nat_gateway.ngw0: Still creating... [10s elapsed]
aws_nat_gateway.ngw1: Still creating... [10s elapsed]
aws_nat_gateway.ngw0: Still creating... [20s elapsed]
aws_nat_gateway.ngw1: Still creating... [20s elapsed]
aws_nat_gateway.ngw0: Still creating... [30s elapsed]
aws_nat_gateway.ngw1: Still creating... [30s elapsed]
aws_nat_gateway.ngw0: Still creating... [40s elapsed]
aws_nat_gateway.ngw1: Still creating... [40s elapsed]
aws_nat_gateway.ngw0: Still creating... [50s elapsed]
aws_nat_gateway.ngw1: Still creating... [50s elapsed]
aws_nat_gateway.ngw0: Still creating... [1m0s elapsed]
aws_nat_gateway.ngw1: Still creating... [1m0s elapsed]
aws_nat_gateway.ngw0: Still creating... [1m10s elapsed]
aws_nat_gateway.ngw1: Still creating... [1m10s elapsed]
aws_nat_gateway.ngw0: Still creating... [1m20s elapsed]
aws_nat_gateway.ngw1: Still creating... [1m20s elapsed]
aws_nat_gateway.ngw0: Still creating... [1m30s elapsed]
aws_nat_gateway.ngw1: Still creating... [1m30s elapsed]
aws_nat_gateway.ngw0: Still creating... [1m40s elapsed]
aws_nat_gateway.ngw1: Still creating... [1m40s elapsed]
aws_nat_gateway.ngw0: Creation complete after 1m45s [id=nat-07c363cea9ebe7c20]
aws_route.private0: Creating...
aws_route.private0: Creation complete after 3s [id=r-rtb-04c52d0c2f4f6fb3e1080289494]
aws_nat_gateway.ngw1: Still creating... [1m50s elapsed]
aws_nat_gateway.ngw1: Still creating... [2m0s elapsed]
aws_nat_gateway.ngw1: Creation complete after 2m6s [id=nat-0a57b2a380445c52a]
aws_route.private1: Creating...
aws_route.private1: Creation complete after 4s [id=r-rtb-0eed5c91cda4b3acc1080289494]

Apply complete! Resources: 20 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"6c23ed6e1a6706c7c9aa27177c03f73ae8bef92d","Vars":{},"WorkflowName":"terraform"} -->